Repository: MatthiasPeltzer/mpc-vidply
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: de

# tx_mpcvidply_media
source: VidPly Media
de: VidPly Medien

# tx_mpcvidply_media.media_type
source: Media Type
de: Medientyp

# tx_mpcvidply_media.hls_kind
source: HLS Type
de: HLS-Typ

# tx_mpcvidply_media.hls_kind.description
source: Choose whether the HLS stream is audio-only (radio) or video
de: Wählen Sie aus, ob der HLS-Stream nur Audio (Radio) oder Video ist

# tx_mpcvidply_media.media_url
source: Media URL
de: Medien-URL

# tx_mpcvidply_media.media_url.description
source: Enter the URL for YouTube, Vimeo, SoundCloud, or HLS stream
de: Geben Sie die URL für YouTube, Vimeo, SoundCloud oder HLS-Stream ein

# tx_mpcvidply_media.media_file
source: Media File
de: Mediendatei

# tx_mpcvidply_media.media_file.description
source: Upload video or audio file
de: Video- oder Audiodatei hochladen

# tx_mpcvidply_media.title
source: Title
de: Titel

# tx_mpcvidply_media.artist
source: Artist / Creator
de: Künstler / Ersteller

# tx_mpcvidply_media.description
source: Description
de: Beschreibung

# tx_mpcvidply_media.duration
source: Duration (seconds)
de: Dauer (Sekunden)

# tx_mpcvidply_media.duration.description
source: Duration in seconds (optional, for display purposes)
de: Dauer in Sekunden (optional, für Anzeigezwecke)

# tx_mpcvidply_media.audio_description_duration
source: Audio Description Duration (seconds)
de: Audiodeskription-Dauer (Sekunden)

# tx_mpcvidply_media.audio_description_duration.description
source: Duration of the audio-described version in seconds (typically longer than the original)
de: Dauer der audiobeschriebenen Version in Sekunden (typischerweise länger als das Original)

# tx_mpcvidply_media.poster
source: Poster / Thumbnail
de: Vorschaubild / Thumbnail

# tx_mpcvidply_media.captions
source: Captions / Subtitles (VTT)
de: Untertitel / Captions (VTT)

# tx_mpcvidply_media.captions.add
source: Add caption file
de: Untertitel-Datei hinzufügen

# tx_mpcvidply_media.chapters
source: Chapters (VTT)
de: Kapitel (VTT)

# tx_mpcvidply_media.chapters.add
source: Add chapter file
de: Kapitel-Datei hinzufügen

# tx_mpcvidply_media.audio_description
source: Audio Description
de: Audiodeskription

# tx_mpcvidply_media.audio_description.add
source: Add audio description
de: Audiodeskription hinzufügen

# tx_mpcvidply_media.sign_language
source: Sign Language Video
de: Gebärdensprache Video

# tx_mpcvidply_media.sign_language.add
source: Add sign language video
de: Gebärdensprache-Video hinzufügen

# tx_mpcvidply_media.sign_language_display_mode
source: Sign Language Display Mode
de: Gebärdensprache-Anzeigemodus

# tx_mpcvidply_media.sign_language_display_mode.description
source: Choose how the sign language video is displayed in the player
de: Wählen Sie, wie das Gebärdensprach-Video im Player angezeigt wird

# tx_mpcvidply_media.sign_language_display_mode.pip
source: Picture-in-Picture (overlay)
de: Bild-im-Bild (Overlay)

# tx_mpcvidply_media.sign_language_display_mode.main
source: In main video (replaces main content)
de: Im Hauptvideo (ersetzt Hauptinhalt)

# tx_mpcvidply_media.sign_language_display_mode.both
source: Both options (PiP and main video)
de: Beide Optionen (PiP und Hauptvideo)

# tx_mpcvidply_media.enable_transcript
source: Enable Transcript
de: Transkript aktivieren

# tx_mpcvidply_media.hide_speed_button
source: Hide speed button
de: Geschwindigkeits-Schaltfläche ausblenden

# tx_mpcvidply_media.hide_speed_button.description
source: When enabled and the record is rendered as a single item, the playback speed control will be hidden.
de: Wenn aktiviert und der Datensatz als Einzel-Element gerendert wird, wird die Wiedergabegeschwindigkeit ausgeblendet.

# tabs.captions
source: Captions & Chapters
de: Untertitel & Kapitel

# tabs.accessibility
source: Accessibility
de: Barrierefreiheit

# tx_mpcvidply_playlist_item
source: VidPly Media Item
de: VidPly Medien-Element

# tx_mpcvidply_playlist_item.media
source: Media File
de: Mediendatei

# tx_mpcvidply_playlist_item.media.description
source: Upload the video or audio file for this item
de: Laden Sie die Video- oder Audiodatei für dieses Element hoch

# tx_mpcvidply_playlist_item.title
source: Title
de: Titel

# tx_mpcvidply_playlist_item.title.description
source: The title of this track (e.g., "Episode 1: Introduction" or "Song Title")
de: Der Titel dieses Titels (z.B. "Episode 1: Einführung" oder "Songtitel")

# tx_mpcvidply_playlist_item.artist
source: Artist / Creator
de: Künstler / Ersteller

# tx_mpcvidply_playlist_item.artist.description
source: Optional: Artist name for audio tracks or creator/director for videos
de: Optional: Künstlername für Audiotitel oder Ersteller/Regisseur für Videos

# tx_mpcvidply_playlist_item.description
source: Description
de: Beschreibung

# tx_mpcvidply_playlist_item.duration
source: Duration (seconds)
de: Dauer (Sekunden)

# tx_mpcvidply_playlist_item.duration.description
source: Optional: Duration in seconds. Leave empty to auto-detect.
de: Optional: Dauer in Sekunden. Leer lassen für automatische Erkennung.

# tx_mpcvidply_playlist_item.poster
source: Poster / Thumbnail
de: Vorschaubild / Thumbnail

# tx_mpcvidply_playlist_item.poster.description
source: Thumbnail image for this specific track (shown in playlist panel)
de: Vorschaubild für diesen spezifischen Titel (wird im Wiedergabelisten-Panel angezeigt)

# tx_mpcvidply_playlist_item.captions
source: Captions / Subtitles
de: Untertitel

# tx_mpcvidply_playlist_item.captions.description
source: WebVTT caption files for this specific track (can have multiple languages)
de: WebVTT-Untertiteldateien für diesen spezifischen Titel (kann mehrere Sprachen haben)

# tx_mpcvidply_playlist_item.chapters
source: Chapters
de: Kapitel

# tx_mpcvidply_playlist_item.chapters.description
source: WebVTT chapter files for this specific track
de: WebVTT-Kapiteldateien für diesen spezifischen Titel

# tx_mpcvidply_playlist_item.audio_description
source: Audio Description
de: Audiodeskription

# tx_mpcvidply_playlist_item.audio_description.description
source: Alternative video with audio description for this specific track
de: Alternatives Video mit Audiodeskription für diesen spezifischen Titel

# tx_mpcvidply_playlist_item.sign_language
source: Sign Language Video
de: Gebärdensprach-Video

# tx_mpcvidply_playlist_item.sign_language.description
source: Sign language overlay video for this specific track
de: Gebärdensprach-Overlay-Video für diesen spezifischen Titel

# tt_content.tx_mpcvidply_playlist_items
source: Playlist Items
de: Wiedergabelisten-Elemente

# tt_content.tx_mpcvidply_playlist_items.description
source: Add playlist items with individual media files and per-track features (captions, chapters, audio description, etc.). This provides maximum flexibility for complex playlists where each track needs different accessibility features.
de: Fügen Sie Wiedergabelisten-Elemente mit individuellen Mediendateien und titelspezifischen Funktionen hinzu (Untertitel, Kapitel, Audiodeskription, usw.). Dies bietet maximale Flexibilität für komplexe Wiedergabelisten, bei denen jeder Titel unterschiedliche Barrierefreiheitsfunktionen benötigt.

# sys_file_reference.tx_lang_code
source: Language Code
de: Sprachcode

# sys_file_reference.tx_track_kind
source: Track Kind
de: Track-Typ

# sys_file_reference.tx_track_kind.captions
source: Captions
de: Untertitel (Captions)

# sys_file_reference.tx_track_kind.subtitles
source: Subtitles
de: Untertitel

# sys_file_reference.tx_track_kind.descriptions
source: Descriptions
de: Beschreibungen

# sys_file_reference.tx_track_kind.chapters
source: Chapters
de: Kapitel

# sys_file_reference.tx_track_kind.metadata
source: Metadata
de: Metadaten

# sys_file_reference.tx_desc_src_file
source: Audio Description Version
de: Audiodeskriptions-Version

# sys_file_reference.tx_desc_src_file.description
source: Alternative VTT file to use when audio description mode is enabled. This file is used instead of the main track when the user activates audio description.
de: Alternative VTT-Datei, die verwendet wird, wenn der Audiodeskriptionsmodus aktiviert ist. Diese Datei ersetzt die Hauptspur, wenn der Benutzer die Audiodeskription aktiviert.

# sys_file_reference.tx_desc_src_file.add
source: Select audio description version
de: Audiodeskriptions-Version auswählen

# tx_mpcvidply_privacy_settings.youtube_headline
source: Headline (optional)
de: Überschrift (optional)

# tx_mpcvidply_privacy_settings.youtube_headline.description
source: Optional headline displayed above the privacy text
de: Optionale Überschrift, die über dem Datenschutztext angezeigt wird

# tx_mpcvidply_privacy_settings.youtube_intro_text
source: Intro Text
de: Einleitungstext

# tx_mpcvidply_privacy_settings.youtube_intro_text.description
source: Text displayed before the privacy policy link (e.g., "To activate the video, you must click on the button. After activating the button,")
de: Text, der vor dem Datenschutzrichtlinien-Link angezeigt wird (z.B. "Um das Video zu aktivieren, müssen Sie auf die Schaltfläche klicken. Nach Aktivierung der Schaltfläche,")

# tx_mpcvidply_privacy_settings.youtube_outro_text
source: Outro Text
de: Abschlusstext

# tx_mpcvidply_privacy_settings.youtube_outro_text.description
source: Text displayed after the privacy policy link (e.g., "applies.")
de: Text, der nach dem Datenschutzrichtlinien-Link angezeigt wird (z.B. "gilt.")

# tx_mpcvidply_privacy_settings.youtube_policy_link
source: Privacy Policy Link
de: Datenschutzrichtlinien-Link

# tx_mpcvidply_privacy_settings.youtube_policy_link.description
source: URL to the privacy policy page (e.g., "https://policies.google.com/privacy")
de: URL zur Datenschutzrichtlinien-Seite (z.B. "https://policies.google.com/privacy")

# tx_mpcvidply_privacy_settings.youtube_link_text.description
source: Text displayed as the clickable link. If empty, uses default translation.
de: Text, der als klickbarer Link angezeigt wird. Wenn leer, wird die Standard-Übersetzung verwendet.

# tx_mpcvidply_privacy_settings.youtube_button_label
source: Button Label (optional)
de: Schaltflächen-Beschriftung (optional)

# tx_mpcvidply_privacy_settings.youtube_button_label.description
source: Accessible label for the play button. If empty, uses default translation.
de: Barrierefreie Beschriftung für die Wiedergabe-Schaltfläche. Wenn leer, wird die Standard-Übersetzung verwendet.

# tx_mpcvidply_privacy_settings.vimeo_headline
source: Headline (optional)
de: Überschrift (optional)

# tx_mpcvidply_privacy_settings.vimeo_headline.description
source: Optional headline displayed above the privacy text
de: Optionale Überschrift, die über dem Datenschutztext angezeigt wird

# tx_mpcvidply_privacy_settings.vimeo_intro_text
source: Intro Text
de: Einleitungstext

# tx_mpcvidply_privacy_settings.vimeo_intro_text.description
source: Text displayed before the privacy policy link (e.g., "To activate the video, you must click on the button. After activating the button,")
de: Text, der vor dem Datenschutzrichtlinien-Link angezeigt wird (z.B. "Um das Video zu aktivieren, müssen Sie auf die Schaltfläche klicken. Nach Aktivierung der Schaltfläche,")

# tx_mpcvidply_privacy_settings.vimeo_outro_text
source: Outro Text
de: Abschlusstext

# tx_mpcvidply_privacy_settings.vimeo_outro_text.description
source: Text displayed after the privacy policy link (e.g., "applies.")
de: Text, der nach dem Datenschutzrichtlinien-Link angezeigt wird (z.B. "gilt.")

# tx_mpcvidply_privacy_settings.vimeo_policy_link
source: Privacy Policy Link
de: Datenschutzrichtlinien-Link

# tx_mpcvidply_privacy_settings.vimeo_policy_link.description
source: URL to the privacy policy page (e.g., "https://vimeo.com/privacy")
de: URL zur Datenschutzrichtlinien-Seite (z.B. "https://vimeo.com/privacy")

# tx_mpcvidply_privacy_settings.vimeo_link_text.description
source: Text displayed as the clickable link. If empty, uses default translation.
de: Text, der als klickbarer Link angezeigt wird. Wenn leer, wird die Standard-Übersetzung verwendet.

# tx_mpcvidply_privacy_settings.vimeo_button_label
source: Button Label (optional)
de: Schaltflächen-Beschriftung (optional)

# tx_mpcvidply_privacy_settings.vimeo_button_label.description
source: Accessible label for the play button. If empty, uses default translation.
de: Barrierefreie Beschriftung für die Wiedergabe-Schaltfläche. Wenn leer, wird die Standard-Übersetzung verwendet.

# tx_mpcvidply_privacy_settings.soundcloud_headline
source: Headline (optional)
de: Überschrift (optional)

# tx_mpcvidply_privacy_settings.soundcloud_headline.description
source: Optional headline displayed above the privacy text
de: Optionale Überschrift, die über dem Datenschutztext angezeigt wird

# tx_mpcvidply_privacy_settings.soundcloud_intro_text
source: Intro Text
de: Einleitungstext

# tx_mpcvidply_privacy_settings.soundcloud_intro_text.description
source: Text displayed before the privacy policy link (e.g., "To activate the widget, you must click on the button. After activating the button,")
de: Text, der vor dem Datenschutzrichtlinien-Link angezeigt wird (z.B. "Um das Widget zu aktivieren, müssen Sie auf die Schaltfläche klicken. Nach Aktivierung der Schaltfläche,")

# tx_mpcvidply_privacy_settings.soundcloud_outro_text
source: Outro Text
de: Abschlusstext

# tx_mpcvidply_privacy_settings.soundcloud_outro_text.description
source: Text displayed after the privacy policy link (e.g., "applies.")
de: Text, der nach dem Datenschutzrichtlinien-Link angezeigt wird (z.B. "gilt.")

# tx_mpcvidply_privacy_settings.soundcloud_policy_link
source: Privacy Policy Link
de: Datenschutzrichtlinien-Link

# tx_mpcvidply_privacy_settings.soundcloud_policy_link.description
source: URL to the privacy policy page (e.g., "https://soundcloud.com/pages/privacy")
de: URL zur Datenschutzrichtlinien-Seite (z.B. "https://soundcloud.com/pages/privacy")

# tx_mpcvidply_privacy_settings.soundcloud_link_text.description
source: Text displayed as the clickable link. If empty, uses default translation.
de: Text, der als klickbarer Link angezeigt wird. Wenn leer, wird die Standard-Übersetzung verwendet.

# tx_mpcvidply_privacy_settings.soundcloud_button_label
source: Button Label (optional)
de: Schaltflächen-Beschriftung (optional)

# tx_mpcvidply_privacy_settings.soundcloud_button_label.description
source: Accessible label for the play button. If empty, uses default translation.
de: Barrierefreie Beschriftung für die Wiedergabe-Schaltfläche. Wenn leer, wird die Standard-Übersetzung verwendet.
