Repository: MatthiasPeltzer/mpc-vidply
Catalog: Resources/Private/Language/*.locallang_*.xlf
Languages: de

# content_element.description
source: Universal, accessible video and audio player with support for HTML5, YouTube, Vimeo, HLS streaming, playlists, captions, and full accessibility features.
de: Universeller, barrierefreier Video- und Audio-Player mit Unterstützung für HTML5, YouTube, Vimeo, HLS-Streaming, Playlists, Untertitel und umfassenden Barrierefreiheitsfunktionen.

# tabs.captions
source: Captions & Chapters
de: Untertitel & Kapitel

# tabs.accessibility
source: Accessibility
de: Barrierefreiheit

# tabs.settings
source: Player Settings
de: Player-Einstellungen

# tabs.playlist
source: Playlist
de: Wiedergabeliste

# tabs.media
source: Media
de: Medien

# tt_content.tx_mpcvidply_media_type
source: Media Type
de: Medientyp

# tt_content.tx_mpcvidply_media_items
source: Media Items
de: Medien-Elemente

# tt_content.tx_mpcvidply_media_items.description
source: Select one or more media items from the media library. Add 2+ items to create a playlist.
de: Wählen Sie ein oder mehrere Medien-Elemente aus der Medienbibliothek. Fügen Sie 2+ Elemente hinzu, um eine Wiedergabeliste zu erstellen.

# tt_content.tx_mpcvidply_media_items.add
source: Create new media item
de: Neues Medien-Element erstellen

# tt_content.tx_mpcvidply_video_url.description
source: For YouTube: https://www.youtube.com/watch?v=VIDEO_ID, For Vimeo: https://vimeo.com/VIDEO_ID
de: Für YouTube: https://www.youtube.com/watch?v=VIDEO_ID, Für Vimeo: https://vimeo.com/VIDEO_ID

# tt_content.tx_mpcvidply_media
source: Media Files
de: Mediendateien

# tt_content.tx_mpcvidply_media_video
source: Video Files (MP4 / WebM)
de: Videodateien (MP4 / WebM)

# tt_content.tx_mpcvidply_media_audio
source: Audio Files (MP3 / WAV / OGG)
de: Audiodateien (MP3 / WAV / OGG)

# tt_content.tx_mpcvidply_poster
source: Poster Image
de: Vorschaubild

# tt_content.tx_mpcvidply_captions
source: Captions / Subtitles
de: Untertitel

# tt_content.tx_mpcvidply_captions.description
source: Add WebVTT (.vtt) files for captions and subtitles. Use the language code field for srclang.
de: WebVTT (.vtt) Dateien für Untertitel hinzufügen. Verwenden Sie das Sprachcode-Feld für srclang.

# tt_content.tx_mpcvidply_captions.add
source: Add Caption Track
de: Untertitel-Spur hinzufügen

# tt_content.tx_mpcvidply_chapters
source: Chapters
de: Kapitel

# tt_content.tx_mpcvidply_chapters.description
source: Add WebVTT (.vtt) files with chapter information. Use the language code field for srclang.
de: WebVTT (.vtt) Dateien mit Kapitelinformationen hinzufügen. Verwenden Sie das Sprachcode-Feld für srclang.

# tt_content.tx_mpcvidply_audio_description
source: Audio Description
de: Audiodeskription

# tt_content.tx_mpcvidply_audio_description.description
source: Upload MP4/WebM video tracks with descriptive audio. Use the language field to provide multiple languages.
de: Laden Sie MP4-/WebM-Videospuren mit beschreibendem Audio hoch. Verwenden Sie das Sprachfeld, um mehrere Sprachen bereitzustellen.

# tt_content.tx_mpcvidply_audio_description.add
source: Add Audio Description Track
de: Audiodeskriptionsspur hinzufügen

# tt_content.tx_mpcvidply_sign_language
source: Sign Language Videos
de: Gebärdensprache-Videos

# tt_content.tx_mpcvidply_sign_language.description
source: Upload MP4/WebM sign language videos. Use the language field to provide multiple languages.
de: Laden Sie MP4-/WebM-Videos mit Gebärdensprache hoch. Verwenden Sie das Sprachfeld, um mehrere Sprachen bereitzustellen.

# tt_content.tx_mpcvidply_sign_language.add
source: Add Sign Language Video
de: Gebärdensprach-Video hinzufügen

# tt_content.tx_mpcvidply_options
source: Player Options
de: Player-Optionen

# tt_content.tx_mpcvidply_options.autoplay
source: Autoplay
de: Automatische Wiedergabe

# tt_content.tx_mpcvidply_options.loop
source: Loop
de: Wiederholen

# tt_content.tx_mpcvidply_options.muted
source: Muted
de: Stummgeschaltet

# tt_content.tx_mpcvidply_options.controls
source: Show Controls
de: Steuerelemente anzeigen

# tt_content.tx_mpcvidply_options.captions_default
source: Captions On by Default
de: Untertitel standardmäßig aktiviert

# tt_content.tx_mpcvidply_options.keyboard
source: Keyboard Shortcuts
de: Tastaturkürzel

# tt_content.tx_mpcvidply_options.auto_advance
source: Auto-advance to Next (Playlist)
de: Automatisch zum nächsten (Wiedergabeliste)

# tt_content.tx_mpcvidply_volume
source: Initial Volume
de: Anfangslautstärke

# tt_content.tx_mpcvidply_volume.description
source: Default volume level (0.0 - 1.0, default: 0.8)
de: Standard-Lautstärke (0.0 - 1.0, Standard: 0.8)

# tt_content.tx_mpcvidply_playback_speed
source: Playback Speed
de: Wiedergabegeschwindigkeit

# tt_content.tx_mpcvidply_playback_speed.description
source: Default playback speed (0.25 - 2.0, default: 1.0)
de: Standard-Wiedergabegeschwindigkeit (0.25 - 2.0, Standard: 1.0)

# tt_content.tx_mpcvidply_language
source: Player Language
de: Player-Sprache

# tt_content.tx_mpcvidply_language.auto
source: Auto (detect from page language)
de: Automatisch (aus Seitensprache ermitteln)

# tt_content.tx_mpcvidply_playlist
source: Enable Playlist Mode
de: Wiedergabelisten-Modus aktivieren

# tt_content.tx_mpcvidply_playlist_auto_advance
source: Auto-advance to Next Track
de: Automatisch zum nächsten Titel wechseln

# tt_content.tx_mpcvidply_playlist_items
source: Media Items
de: Medien-Elemente

# tt_content.tx_mpcvidply_playlist_items.description
source: Add media items (video or audio files). Each item can have its own title, poster, captions, chapters, audio description, and sign language video. Add 1 item for a single video/audio, or multiple items to create a playlist.
de: Fügen Sie Medien-Elemente hinzu (Video- oder Audiodateien). Jedes Element kann einen eigenen Titel, Vorschaubild, Untertitel, Kapitel, Audiodeskription und Gebärdensprach-Video haben. Fügen Sie 1 Element für ein einzelnes Video/Audio hinzu, oder mehrere Elemente um eine Wiedergabeliste zu erstellen.

# tx_mpcvidply_privacy_settings
source: Privacy Layer Settings
de: Datenschutz-Einstellungen

# config.allowedVideoDomains
source: Allowed domains for external videos
de: Zulässige Domains für externe Videos

# config.allowedVideoDomains.list
source: Comma or newline separated list of allowed domains for external video URLs (e.g. *.xyz.de, www.xyz.de, https://*.xyz.de)
de: Durch Komma oder Zeilenumbruch getrennte Liste zulässiger Domains für externe Video-URLs (z.B. *.xyz.de, www.xyz.de, https://*.xyz.de)

# config.allowedAudioDomains
source: Allowed domains for external audio files
de: Zulässige Domains für externe Audio-Dateien

# config.allowedAudioDomains.list
source: Comma or newline separated list of allowed domains for external audio URLs (e.g. *.xyz.de, www.xyz.de, https://*.xyz.de)
de: Durch Komma oder Zeilenumbruch getrennte Liste zulässiger Domains für externe Audio-URLs (z.B. *.xyz.de, www.xyz.de, https://*.xyz.de)

# config.playIcon
source: Play button icon (EXT: path, URL, or public path)
de: Play-Button Icon (EXT: Pfad, URL oder öffentlicher Pfad)

# config.playPosition
source: Play button position
de: Position des Play-Buttons

# config.useCssIcons
source: Use CSS-based icons (enables icon customization via CSS variables)
de: CSS-basierte Icons verwenden (ermöglicht Icon-Anpassung über CSS-Variablen)

# player.play
source: Play
de: Abspielen

# player.stop
source: Stop
de: Stopp

# player.mute
source: Mute
de: Stumm

# player.unmute
source: Unmute
de: Ton einschalten

# player.fullscreen
source: Fullscreen
de: Vollbild

# player.captions
source: Captions
de: Untertitel

# player.previous
source: Previous
de: Zurück

# player.next
source: Next
de: Weiter

# privacy.activate_intro
source: To activate the video, you must click on the button. After activating the button,
de: Um das Video zu aktivieren, müssen Sie auf die Schaltfläche klicken. Nach dem Aktivieren gilt

# privacy.activate_intro_widget
source: To activate the widget, you must click on the button. After activating the button,
de: Um das Widget zu aktivieren, müssen Sie auf die Schaltfläche klicken. Nach dem Aktivieren gilt

# privacy.youtube.policy_link
source: Google's privacy policy
de: die Datenschutzerklärung von Google

# privacy.vimeo.policy_link
source: Vimeo's privacy policy
de: die Datenschutzerklärung von Vimeo

# privacy.soundcloud.policy_link
source: SoundCloud's privacy policy
de: die Datenschutzerklärung von SoundCloud

# privacy.load_content
source: Load {0} content
de: {0}-Inhalt laden
